Revit 2027 API
ParameterTypeId.StructuralConnectionEditRangesOfApplicability Property
 "Modify Ranges of applicability"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionEditRangesOfApplicability { get; }
Public Shared ReadOnly Property StructuralConnectionEditRangesOfApplicability As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionEditRangesOfApplicability {
	ForgeTypeId^ get ();
}
static member StructuralConnectionEditRangesOfApplicability : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace